Ran Plan for dir: `deployment/cloud` workspace: `default`

<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # kubectl_manifest.sonarqube_secret will be created
+ resource "kubectl_manifest" "sonarqube_secret" {
      + api_version             = "v1"
      + apply_only              = false
      + force_conflicts         = false
      + force_new               = false
      + id                      = (known after apply)
      + kind                    = "Secret"
      + live_manifest_incluster = (sensitive value)
      + live_uid                = (known after apply)
      + name                    = "sonarqube-secret"
      + namespace               = "sonarqube"
      + server_side_apply       = false
      + uid                     = (known after apply)
      + validate_schema         = true
      + wait_for_rollout        = true
      + yaml_body               = (sensitive value)
      + yaml_body_parsed        = <<-EOT
            apiVersion: v1
            data: (sensitive value)
            kind: Secret
            metadata:
              name: sonarqube-secret
              namespace: sonarqube
            type: Opaque
        EOT
      + yaml_incluster          = (sensitive value)
    }

  # module.sonarqube.helm_release.helm is tainted, so must be replaced
-/+ resource "helm_release" "helm" {
      ~ id                         = "fta-helm-sonarqube" -> (known after apply)
      + manifest                   = (known after apply)
      ~ metadata                   = [
          - {
              - app_version    = "10.6.0"
              - chart          = "sonarqube"
              - first_deployed = 1727597223
              - last_deployed  = 1727597223
              - name           = "fta-helm-sonarqube"
              - namespace      = "sonarqube"
              - notes          = <<-EOT
                    1. Get the application URL by running these commands:
                      http://sonarqube.fta.blast.co.id
                    WARNING: 
                             Please note that the SonarQube image runs with a non-root user (uid=1000) belonging to the root group (guid=0). In this way, the chart can support arbitrary user ids as recommended in OpenShift.
                             Please visit https://docs.openshift.com/container-platform/4.14/openshift_images/create-images.html#use-uid_create-images for more information.
                EOT
              - revision       = 1
              - values         = jsonencode(
                    {
                      - account                  = {
                          - adminPasswordSecretName = "sonarqube-secret"
                        }
                      - containerSecurityContext = {
                          - allowPrivilegeEscalation = false
                          - capabilities             = {
                              - drop = [
                                  - "ALL",
                                ]
                            }
                          - runAsGroup               = 0
                          - runAsNonRoot             = true
                          - runAsUser                = 1000
                          - seccompProfile           = {
                              - type = "RuntimeDefault"
                            }
                        }
                      - deploymentType           = "StatefulSet"
                      - edition                  = "community"
                      - extraConfig              = {
                          - secrets = [
                              - "sonarqube-jdbc",
                            ]
                        }
                      - image                    = {
                          - pullPolicy = "IfNotPresent"
                          - repository = "sonarqube"
                          - tag        = "10.6.0-{{ .Values.edition }}"
                        }
                      - ingress                  = {
                          - annotations      = {
                              - "cert-manager.io/cluster-issuer"              = "letsencrypt-fta"
                              - "external-dns.alpha.kubernetes.io/hostname"   = "sonarqube.fta.blast.co.id"
                              - "kubernetes.io/tls-acme"                      = "true"
                              - "nginx.ingress.kubernetes.io/proxy-body-size" = "64m"
                            }
                          - enabled          = true
                          - hosts            = [
                              - {
                                  - name     = "sonarqube.fta.blast.co.id"
                                  - path     = "/"
                                  - pathType = "ImplementationSpecific"
                                },
                            ]
                          - ingressClassName = "nginx"
                          - tls              = [
                              - {
                                  - hosts      = [
                                      - "sonarqube.fta.blast.co.id",
                                    ]
                                  - secretName = "sonarqube-tls"
                                },
                            ]
                        }
                      - initFs                   = {
                          - enabled         = true
                          - securityContext = {
                              - capabilities           = {
                                  - add  = [
                                      - "CHOWN",
                                    ]
                                  - drop = [
                                      - "ALL",
                                    ]
                                }
                              - privileged             = false
                              - readOnlyRootFilesystem = true
                              - runAsGroup             = 0
                              - runAsNonRoot           = false
                              - runAsUser              = 0
                              - seccompProfile         = {
                                  - type = "RuntimeDefault"
                                }
                            }
                        }
                      - initSysctl               = {
                          - enabled         = true
                          - fsFileMax       = 131072
                          - nofile          = 131072
                          - nproc           = 8192
                          - securityContext = {
                              - privileged             = true
                              - readOnlyRootFilesystem = true
                              - runAsUser              = 0
                            }
                          - vmMaxMapCount   = 524288
                        }
                      - jdbcOverwrite            = {
                          - enabled               = true
                          - jdbcSecretName        = "sonarqube-secret"
                          - jdbcSecretPasswordKey = "jdbc-password"
                          - jdbcUrl               = "jdbc:postgresql://34.128.115.248:5432/sonar_db"
                          - jdbcUsername          = "sonar"
                        }
                      - nodeSelector             = {
                          - "iam.gke.io/gke-metadata-server-enabled" = "true"
                        }
                      - postgresql               = {
                          - enabled = false
                        }
                      - replicaCount             = 1
                      - resources                = {
                          - limits   = {
                              - cpu               = "800m"
                              - ephemeral-storage = "512000M"
                              - memory            = "6144M"
                            }
                          - requests = {
                              - cpu               = "400m"
                              - ephemeral-storage = "1536M"
                              - memory            = "2048M"
                            }
                        }
                      - revisionHistoryLimit     = 10
                      - securityContext          = {
                          - fsGroup = 0
                        }
                      - service                  = {
                          - externalPort = 9000
                          - internalPort = 9000
                          - type         = "ClusterIP"
                        }
                      - serviceAccount           = {
                          - annotations    = {
                              - "iam.gke.io/gcp-service-account" = "fta-mstr-helm-sonarqube@fta-platform.iam.gserviceaccount.com"
                            }
                          - automountToken = true
                          - create         = true
                        }
                    }
                )
              - version        = "10.6.1+3163"
            },
        ] -> (known after apply)
        name                       = "fta-helm-sonarqube"
      ~ status                     = "failed" -> "deployed"
      ~ values                     = (sensitive value)
        # (25 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 1 to destroy.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d deployment/cloud
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://fta-mstr-gce-atlantis:4141/lock?id=greyhats13%252Ffta_iac%252Fdeployment%252Fcloud%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d deployment/cloud
  ```
Plan: 2 to add, 0 to change, 1 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```